## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_container_registry.cr has been deleted
  - resource "azurerm_container_registry" "cr" {
      - admin_password                = (sensitive value) -> null
      - admin_username                = "8918finalgroup6acr" -> null
        id                            = "/subscriptions/a61f90e1-d9c8-4c9c-9cd5-0a904a50cf48/resourceGroups/cst8918-final-project-group-fp6/providers/Microsoft.ContainerRegistry/registries/8918finalgroup6acr"
      - login_server                  = "8918finalgroup6acr.azurecr.io" -> null
        name                          = "8918finalgroup6acr"
        # (15 unchanged attributes hidden)
    }

  # azurerm_kubernetes_cluster.prod_cluster has been deleted
  - resource "azurerm_kubernetes_cluster" "prod_cluster" {
        id                                  = "/subscriptions/a61f90e1-d9c8-4c9c-9cd5-0a904a50cf48/resourceGroups/cst8918-final-project-group-fp6/providers/Microsoft.ContainerService/managedClusters/8918-prod-cluster-group06"
      - kube_config_raw                     = (sensitive value) -> null
        name                                = "8918-prod-cluster-group06"
        # (32 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # azurerm_kubernetes_cluster.test_cluster has been deleted
  - resource "azurerm_kubernetes_cluster" "test_cluster" {
        id                                  = "/subscriptions/a61f90e1-d9c8-4c9c-9cd5-0a904a50cf48/resourceGroups/cst8918-final-project-group-fp6/providers/Microsoft.ContainerService/managedClusters/8918-test-cluster-group06"
      - kube_config_raw                     = (sensitive value) -> null
        name                                = "8918-test-cluster-group06"
        # (32 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # azurerm_resource_group.rg has been deleted
  - resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/a61f90e1-d9c8-4c9c-9cd5-0a904a50cf48/resourceGroups/cst8918-final-project-group-fp6"
      - location   = "canadacentral" -> null
      - name       = "cst8918-final-project-group-fp6" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_subnet.prod_subnet has been deleted
  - resource "azurerm_subnet" "prod_subnet" {
      - id                                             = "/subscriptions/a61f90e1-d9c8-4c9c-9cd5-0a904a50cf48/resourceGroups/cst8918-final-project-group-fp6/providers/Microsoft.Network/virtualNetworks/cdo8918finalvnet/subnets/prod-subnet" -> null
        name                                           = "prod-subnet"
        # (7 unchanged attributes hidden)
    }

  # azurerm_subnet.test_subnet has been deleted
  - resource "azurerm_subnet" "test_subnet" {
      - id                                             = "/subscriptions/a61f90e1-d9c8-4c9c-9cd5-0a904a50cf48/resourceGroups/cst8918-final-project-group-fp6/providers/Microsoft.Network/virtualNetworks/cdo8918finalvnet/subnets/test-subnet" -> null
        name                                           = "test-subnet"
        # (7 unchanged attributes hidden)
    }

  # azurerm_virtual_network.vnet has been deleted
  - resource "azurerm_virtual_network" "vnet" {
        id                      = "/subscriptions/a61f90e1-d9c8-4c9c-9cd5-0a904a50cf48/resourceGroups/cst8918-final-project-group-fp6/providers/Microsoft.Network/virtualNetworks/cdo8918finalvnet"
      - name                    = "cdo8918finalvnet" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_registry.cr will be created
  + resource "azurerm_container_registry" "cr" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "canadacentral"
      + login_server                  = (known after apply)
      + name                          = "8918finalgroup6acr"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "cst8918-final-project-group-fp6"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # azurerm_kubernetes_cluster.prod_cluster will be created
  + resource "azurerm_kubernetes_cluster" "prod_cluster" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "8919-group6-prod-cluster"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.26.10"
      + location                            = "canadacentral"
      + name                                = "8918-prod-cluster-group06"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "cst8918-final-project-group-fp6"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + workload_identity_enabled           = false

      + default_node_pool {
          + enable_auto_scaling  = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 3
          + max_pods             = (known after apply)
          + min_count            = 1
          + name                 = "default"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2s"
          + vnet_subnet_id       = (known after apply)
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_profile {
          + dns_service_ip     = "10.5.0.10"
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "azure"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = "10.5.0.0/24"
          + service_cidrs      = (known after apply)
        }
    }

  # azurerm_kubernetes_cluster.test_cluster will be created
  + resource "azurerm_kubernetes_cluster" "test_cluster" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "8919-group6-test-cluster"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.26.10"
      + location                            = "canadacentral"
      + name                                = "8918-test-cluster-group06"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "cst8918-final-project-group-fp6"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + workload_identity_enabled           = false

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2s"
          + vnet_subnet_id       = (known after apply)
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_profile {
          + dns_service_ip     = "10.6.0.10"
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "azure"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = "10.6.0.0/24"
          + service_cidrs      = (known after apply)
        }
    }

  # azurerm_redis_cache.prod_redis will be created
  + resource "azurerm_redis_cache" "prod_redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "canadacentral"
      + minimum_tls_version           = "1.2"
      + name                          = "prod-redis-yuan0037"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = (known after apply)
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "cst8918-final-project-group-fp6"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + subnet_id                     = (known after apply)
    }

  # azurerm_redis_cache.test_redis will be created
  + resource "azurerm_redis_cache" "test_redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "canadacentral"
      + minimum_tls_version           = "1.2"
      + name                          = "test-redis-yuan0037"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = (known after apply)
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "cst8918-final-project-group-fp6"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + subnet_id                     = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "canadacentral"
      + name     = "cst8918-final-project-group-fp6"
    }

  # azurerm_subnet.admin_subnet will be created
  + resource "azurerm_subnet" "admin_subnet" {
      + address_prefixes                               = [
          + "10.3.0.0/16",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "admin-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "cst8918-final-project-group-fp6"
      + virtual_network_name                           = "cdo8918finalvnet"
    }

  # azurerm_subnet.dev_subnet will be created
  + resource "azurerm_subnet" "dev_subnet" {
      + address_prefixes                               = [
          + "10.2.0.0/16",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dev-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "cst8918-final-project-group-fp6"
      + virtual_network_name                           = "cdo8918finalvnet"
    }

  # azurerm_subnet.prod_subnet will be created
  + resource "azurerm_subnet" "prod_subnet" {
      + address_prefixes                               = [
          + "10.0.0.0/16",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "prod-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "cst8918-final-project-group-fp6"
      + virtual_network_name                           = "cdo8918finalvnet"
    }

  # azurerm_subnet.test_subnet will be created
  + resource "azurerm_subnet" "test_subnet" {
      + address_prefixes                               = [
          + "10.1.0.0/16",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "test-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "cst8918-final-project-group-fp6"
      + virtual_network_name                           = "cdo8918finalvnet"
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/14",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "canadacentral"
      + name                = "cdo8918finalvnet"
      + resource_group_name = "cst8918-final-project-group-fp6"
      + subnet              = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ acr_login_server    = "8918finalgroup6acr.azurecr.io" -> (known after apply)
  ~ acr_password        = (sensitive value)
  ~ acr_username        = "8918finalgroup6acr" -> (known after apply)
  ~ kube_config_prod    = (sensitive value)
  ~ kube_config_test    = (sensitive value)
```
</details>